# Леонтьев Андрей
# ИУ7-14Б
# Лабораторная работа №2 ”Написание алгоритмов с выбором условий” 
# Принадлежность точки область по x,y 


#Запрашиваем x,y на ввод
x = float(input('Введите значение x: '))
y = float(input('Введите значение y: '))

 #Вводим переменную для проверки истинности
if (-9 <= x <= -1 and y >= 0 and y <= (-1/8)*(x+9)**2 + 8 and #Проверяем область графика x=[-9;1], y>=0
    y >= 7*(x+8)**2 + 1 and y >= (1/49)*(x+1)**2):
    flag = True
elif (1 <= x <= 9 and y >= 0 and y <= (-1/8)*(x-9)**2 + 8 and #Проверяем область графика x=[1;9], y>=0
    y >= 7*(x-8)**2+1 and y >= (1/49)*(x-1)**2):
    flag = True
elif y <= -4*x**2+2 and y >= 4*x**2-6:                        #Проверяем область графика x=[-1;1]
    flag = True
elif -2 <= x <=2 and (x==(3/2)*x+2 or x==(-3/2)*x+2):         #Проверяем область графика x=[-2;2], y>=2
    flag = True
elif (-8 <= x <= -1 and y <= 0 and y <= (-1/16)*x**2 and      #Проверяем область графика x=[-8;-1], y<=0
    y >= (1/3)*(x+5)**2 - 7 and y >= -2*(x+1)**2 - 2):
    flag = True
elif (1 <= x <= 8 and y <= 0 and y >= (1/3)*(x-5)**2 - 7      #Проверяем область графика x=[1;8], y<=0
    and y >= -2*(x-1)**2 - 2 and y <= (-1/16)*x**2):
    flag = True

    


print(f'Точка x={x}, y={y} принадлежит области' if flag == True else f'Точка x={x}, y={y} не принадлежит области')