from numpy.random import randint


def get_int(text, is_arr):
    """
    Ввод int
    """
    try:
        el = int(input(text))
        if is_arr is True:
            return el
        else:
            if el <= 0:
                raise ValueError('Введено не положительное число')
            else:
                return el
    except ValueError:
        print('Это не целое число')
        return get_int(text, is_arr)
    except Exception:
        print(Exception)
        return get_int(text, is_arr)


def get_arr(n):
    """
    Ввод массива
    """
    arr = [0] * n
    for i in range(n):
        el = get_int(f'Введите элемент массива {(i + 1)}/{n}: ', True)
        arr[i] = el
    return arr


def generate_arr(n):
    """
    Генерация массивов
    """
    arr = randint(-n, n, size=n)
    return arr


def output(t1, cnt1, t2, cnt2, t3, cnt3, t4, cnt4, t5, cnt5, t6, cnt6, t7,
           cnt7, t8, cnt8, t9, cnt9):
    """
    Вывод таблицы
    """
    print('-----------------------------------------------------'
          '--------------------------------------')
    print('|', ' ' * 20, '|', f'{'N1':^20}', '|', f'{'N2':^20}', '|',
          f'{'N3':^20}', '|')
    print('-----------------------------------------------------'
          '--------------------------------------')
    print('|', ' ' * 20, '|', f'{'время':^8}|{'Перестановки': ^10}|'*3)
    print('-----------------------------------------------------'
          '--------------------------------------')
    print('|', f'{'Упорядоченный список': ^20}', '|',
          f'{t1: ^ 10.3f}|{cnt1: ^10.6g}|',
          f'{t2: ^ 10.3f}|{cnt2: ^10.6g}|', f'{t3: ^ 10.3f}|{cnt3: ^10.6g}|')
    print('-----------------------------------------------------'
          '--------------------------------------')
    print('|', f'{'Случайный список': ^20}', '|',
          f'{t4: ^ 10.3f}|{cnt4: ^10.6g}|',
          f'{t5: ^ 10.3f}|{cnt5: ^10.6g}|', f'{t6: ^ 10.3f}|{cnt6: ^10.6g}|')
    print('-----------------------------------------------------'
          '--------------------------------------')
    print('|', f'{'В обратном порядке': ^20}', '|',
          f'{t7: ^ 10.3f}|{cnt7: ^10.6g}|',
          f'{t8: ^ 10.3f}|{cnt8: ^10.6g}|', f'{t9: ^ 10.3f}|{cnt9: ^10.6g}|')
    print('-----------------------------------------------------'
          '--------------------------------------')
