def get_text():
    text = [
     '52 Да здравствует Санкт-Петербург,',
     '-3 + 3',
     '-3+3+1/4*2+6',
     'и это город наш. Я каждый свой новый куплет валю',
     'как никогда. Альбом, он чисто мой,',
     'никому его не продам! Не думаю о том,',
     'как хорошо было вчера, меняю города, представляю район',
     'у меня есть репертуар. Никогда не просил,',
     'но всегда где-то доставал. Чем больше денег,',
     'тем больше мне нравится Москва. Но в Питере душа,',
     'в Питере семья, в Питере братва,',
     'там знают наши имена +7+952*81+2.',
        ]

    return text
